quotes.md

# Programming<a id="sec-1" name="sec-1"></a>

## Functional Programming<a id="sec-1-1" name="sec-1-1"></a>

> OO makes code understandable by encapsultating the moving parts. FP makes code understandable by minimizing moving parts.~ Michael Feathers

# Keeping Backup Copies<a id="sec-2" name="sec-2"></a>

> Even if you have no need for a synchronization application, you will still need to
> back up your work regularly. Because you are lazy and prone to magical thinking, you
> will not do this responsibly by yourself.~ Kieran Healy

<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <https://twitter.com/mfeathers/status/29581296216></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> Healy, Kieran. "Choosing Your Workflow Applications."</div>


</div>
</div>
